sonicFoam/sod_shock_tube-v2312/system/functionObject2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
(

gradient_aposteriori
{
    type                calcFvcGrad;
    libs  ("libFVFunctionObjects.so");

    fieldName "U";
    resultName "gU";    
}

);
